micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rif.c
  * @author  MCD Application Team
  * @brief   RIF HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Resource Isolation Framework (RIF) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                ##### RIF main features #####
  ==============================================================================
  [..]
    (+) Resource Isolation framework (RIF) is a comprehensive set of hardware
    blocks designed to enforce and manage isolation of STM32 hardware resources
    like memory and peripherals.

    (+) Resource Isolation Framework (RIF) composed of the following sub-blocks:
      (++) RIMC:  Resource Isolation Master Controller
                  This sub-block assigns all non RIF-aware bus master to one
                  security domain by setting secure, privileged and compartment
                  information on the system bus.
                  Note that if non-secure software is permitted to configure one of
                  these peripherals, then this setting is ignored and all accesses
                  initiated by the peripheral are forced to be non-secure.
      (++) RISC:  Resource Isolation Slave Controller
                  This sub-block assigns all non-RIF aware peripherals to zero,
                  one or any security domains (secure, privilege, compartment).
      (++) RISAF: Resource Isolation Slave unit for Address space (Full version)
                  This sub-block assigns memory regions and subregions to one or
                  more security domains (secure, privilege, compartment).
      (++) IAC:   Illegal Access Controller
                  This sub-block centralizes detection of RIF-related accesses,
                  managed by a secure application. Supported illegal accesses are:
                  secure, privileged.

  [..]
    (+) All the setter functions are protected under the CPU_AS_TRUSTED_DOMAIN
        directive.
        It ensures that only the trusted domain can manage the critical
        configurations of the RIF.
        This directive is defined in the CMSIS file.

 ===============================================================================
                     ##### How to use this driver #####
 ===============================================================================
  [..]
    *** Locking RIF components configuration ***
    ============================================================
    [..]
    (#) Lock and get the lock configuration of RIMC registers until next reset
        with HAL_RIF_RIMC_Lock / HAL_RIF_RIMC_GetLock.
    (#) Lock and get the lock configuration of RISC registers until next reset
        with HAL_RIF_RISC_Lock / HAL_RIF_RISC_GetLock.
    (#) Lock and get the lock configuration of slave resources registers until
        next reset with HAL_RIF_RISC_SlaveConfigLock / HAL_RIF_RISC_GetSlaveConfigLock.
    (#) Lock and get the lock configuration of RISAF registers until next reset
        with HAL_RIF_RISAF_Lock / HAL_RIF_RISAF_GetLock.

    *** Context-related functions ***
    ============================================================
    [..]
    (#) Set or get Debugger Access Port Compartment ID with HAL_RIF_RIMC_SetDebugAccessPortCID /
        HAL_RIF_RIMC_GetDebugAccessPortCID functions.
    (#) Check the Debug Domain and Global Debug Domain status with
        HAL_RIF_RIMC_GetDebugStatus.

#if defined(GENERATOR_RIF_FEATURE_ENCRYPTION_IMPLEMENTED)
    *** Encryption-related functions ***
    ============================================================
    [..]
    (#) Read of write RISAF encryption keys and related flags.

#endif
     *** Configuration of master-related attributes ***
    ============================================================
    [..]
    (#) Set or get the secure, privilege and compartment configuration of a
        bus master thanks to the HAL_RIF_RIMC_ConfigMasterAttributes /
        HAL_RIF_RIMC_GetConfigMasterAttributes functions.
    (#) Lock and get lock status the bus master attributes configuration until
        next system reset using HAL_RIF_RIMC_Lock.

     *** Configuration of slave-related attributes ***
    ============================================================
    [..]
    (#) Set or get the secure and privilege configuration of a bus slave
        thanks to the HAL_RIF_RISC_SetSlaveSecureAttributes /
        HAL_RIF_RISC_GetSlaveSecureAttributes functions.
    (#) Lock and get lock status each bus slave attributes configuration using
        HAL_RIF_RISC_SlaveConfigLock or lock the whole RISC configuration with
        HAL_RIF_RISC_Lock until next system reset.

     *** Configuration of RISAF attributes ***
    ============================================================
    [..]
    (#) Set or get a base region configuration with HAL_RIF_RISAF_ConfigBaseRegion /
        HAL_RIF_RISAF_GetConfigBaseRegion.
    (#) Set or get a subregion configuration with HAL_RIF_RISAF_ConfigSubRegion /
        HAL_RIF_RISAF_GetConfigSubRegion.
    (#) Delegate a subregion configuration to another CID with HAL_RIF_RISAF_ConfigSubRegionDelegation.
    (#) Get the data from an illegal access to a protected memory region with
        HAL_RIF_RISAF_GetIllegalAccess.

     *** IAC related functions ***
    ============================================================
    [..]
    (#) Enable or disable peripheral illegal access detection with HAL_RIF_IAC_EnableIT /
        HAL_RIF_IAC_DisableIT.
    (#) Retrieve an illegal access flag from a designated peripheral with HAL_RIF_IAC_GetFlag
        or clear it with HAL_RIF_IAC_ClearFlag.
    (#) Illegal access interrupt service routines are served by HAL_RIF_IRQHandler()
        and user can add his own code using HAL_RIF_ILA_Callback().

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @defgroup RIF RIF
  * @brief RIF HAL module driver.
  * @{
  */

