micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
#ifdef HAL_RIF_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines ------------------------------------------------------------*/
/** @addtogroup RIF_Private_Defines RIF Private Defines
  * @{
  */
#define RIF_PERIPH_IAC_REG_MAX             4U
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup RIF_Exported_Functions RIF Exported Functions
  *  @{
  */

/** @defgroup RIF_Exported_Functions_Group1  RIMC Configuration functions
  *  @brief    RIMC Configuration functions
  *
@verbatim
  ==============================================================================
            ##### RIMC Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RIMC
    RIMC is Resource Isolation Master Controller
@endverbatim
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
/**
  * @brief  Lock overall configuration of RIMC.
  * @note   Once set, the overall configuration of RIMC cannot be modified
  *         upon next system reset.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @retval None
  */
void HAL_RIF_RIMC_Lock(void)
{
  /* Set RIMC Lock bit */
  RIFSC->RIMC_CR |= RIFSC_RIMC_CR_GLOCK;
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE) */

/**
  * @brief  Get RIMC global lock status.
  * @retval RIF_LOCK_ENABLE if RIMC configuration is locked, else RIF_LOCK_DISABLE
  */
uint32_t HAL_RIF_RIMC_GetLock(void)
{
  uint32_t lock_status;

  /* Read RIMC lock bit */
  lock_status = (RIFSC->RIMC_CR & RIF_LOCK_ENABLE);

  return lock_status;
}

#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
/**
  * @brief  Change the Debugger Access Port ID
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @param  CID  specifies the Debugger Access Port CID
  *         This parameter can be a combination of following values:
  *           @arg @ref RIF_CID_0    Compartment 0 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_1    Compartment 1 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_2    Compartment 2 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_3    Compartment 3 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_4    Compartment 4 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_5    Compartment 5 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_6    Compartment 6 ID selected as Debug access port ID
  *           @arg @ref RIF_CID_7    Compartment 7 ID selected as Debug access port ID
  * @retval None
  */
void HAL_RIF_RIMC_SetDebugAccessPortCID(uint32_t CID)
{
  uint32_t dap_cid;
  uint32_t rimc_cr_reg;

  /* Check the parameter */
  assert_param(IS_RIF_SINGLE_CID(CID));

  /* Set Debug Access Port CID bits */
  dap_cid = POSITION_VAL(CID);
  rimc_cr_reg = RIFSC->RIMC_CR;
  rimc_cr_reg &= (~RIFSC_RIMC_CR_DAPCID);
  rimc_cr_reg |= (dap_cid << RIFSC_RIMC_CR_DAPCID_Pos);
  RIFSC->RIMC_CR = rimc_cr_reg;
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE) */

/**
  * @brief  Get the Debugger Access Port ID
  * @retval Debugger Access Port ID
  */
uint32_t HAL_RIF_RIMC_GetDebugAccessPortCID(void)
{
  uint32_t dap_cid;

  /* Read Debug Access Port CID bits */
  dap_cid = (RIFSC->RIMC_CR & RIFSC_RIMC_CR_DAPCID) >> RIFSC_RIMC_CR_DAPCID_Pos;
  dap_cid = (1UL << dap_cid);
  return dap_cid;
}

#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
/**
  * @brief  Configure CID, Secure and Privilege attributes for the designated master.
  * @note   RIF_CID_7 is not an authorized value for the MasterCID field.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @param  MasterId specifies the index of the bus master.
  *         This parameter can be one of @ref RIF_MASTER_INDEX
  * @param  pConfig Pointer on Master Isolation configuration structure
  * @retval None
  */
void HAL_RIF_RIMC_ConfigMasterAttributes(uint32_t MasterId, const RIMC_MasterConfig_t *pConfig)
{
  uint32_t master_cid;
  uint32_t rimc_attr_val;

  /* Check the parameter */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RIF_MASTER_INDEX(MasterId));
  assert_param(IS_RIF_SINGLE_CID(pConfig->MasterCID));
  assert_param(IS_RIF_MASTER_CID(pConfig->MasterCID));
  assert_param(IS_RIF_SEC_PRIV_ATTRIBUTE(pConfig->SecPriv));

  master_cid = POSITION_VAL(pConfig->MasterCID);
  rimc_attr_val = RIFSC->RIMC_ATTRx[MasterId];
  rimc_attr_val &= (~(RIFSC_RIMC_ATTRx_MCID | RIFSC_RIMC_ATTRx_MPRIV | RIFSC_RIMC_ATTRx_MSEC));
  rimc_attr_val |= ((master_cid << RIFSC_RIMC_ATTRx_MCID_Pos) | (pConfig->SecPriv << RIFSC_RIMC_ATTRx_MSEC_Pos));
  RIFSC->RIMC_ATTRx[MasterId] = rimc_attr_val;
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE) */

/**
  * @brief  Get the CID, Secure and Privilege attributes for the designated master.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  MasterId specifies the index of the bus master.
  *         This parameter can be one of @ref RIF_MASTER_INDEX
  * @param  pConfig Pointer on Master Isolation configuration structure
  * @retval None
  */
void HAL_RIF_RIMC_GetConfigMasterAttributes(uint32_t MasterId, RIMC_MasterConfig_t *pConfig)
{
  uint32_t master_cid;
  uint32_t rimc_attr_val;

  /* Check the parameter */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RIF_MASTER_INDEX(MasterId));

