micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
  rimc_attr_val = RIFSC->RIMC_ATTRx[MasterId];
  pConfig->SecPriv = ((rimc_attr_val & (RIFSC_RIMC_ATTRx_MPRIV | RIFSC_RIMC_ATTRx_MSEC))
                      >> RIFSC_RIMC_ATTRx_MSEC_Pos);
  master_cid = ((rimc_attr_val & RIFSC_RIMC_ATTRx_MCID) >> RIFSC_RIMC_ATTRx_MCID_Pos);
  pConfig->MasterCID = (1UL << master_cid);
}
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group2  RIFSC Configuration functions
  *  @brief    RIFSC Configuration functions
  *
@verbatim
  ==============================================================================
            ##### RIFSC Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RIFSC
    RIFSC is Resource Isolation Framework Secure Controller
@endverbatim
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
/**
  * @brief  Lock overall configuration of RISC.
  * @note   Once set, the overall configuration of RIFSC cannot be modified
  *         upon next system reset.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @retval None
  */
void HAL_RIF_RISC_Lock(void)
{
  /* Set RISC Lock bit */
  RIFSC->RISC_CR |= RIFSC_RISC_CR_GLOCK;
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE) */

/**
  * @brief  Get the RIFSC global lock status.
  * @retval 1 if RISC configuration is locked, else 0
  */
uint32_t HAL_RIF_RISC_GetLock(void)
{
  uint32_t lock_status;

  /* Read RISC lock bit */
  lock_status = (RIFSC->RISC_CR & RIF_LOCK_ENABLE);

  return lock_status;
}

/**
  * @brief  Configure the Security and Privilege of a designated slave peripheral.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @param  SecPriv specifies the security and privilege attributes of the peripheral.
  *         This parameter can be one or a combination of @ref RIF_SEC_PRIV
  * @retval None
  */
void HAL_RIF_RISC_SetSlaveSecureAttributes(uint32_t PeriphId, uint32_t SecPriv)
{
  __IO uint32_t sec_reg_val;

  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_RCC_PERIPH_INDEX(PeriphId));
  assert_param(IS_RIF_SEC_PRIV_ATTRIBUTE(SecPriv));

  sec_reg_val = RIFSC->RISC_SECCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT];
  sec_reg_val &= (~(1U << (PeriphId & RIF_PERIPH_BIT_POSITION)));
  sec_reg_val |= ((SecPriv & RIF_ATTRIBUTE_SEC) << (PeriphId & RIF_PERIPH_BIT_POSITION));
  RIFSC->RISC_SECCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT] = sec_reg_val;

  sec_reg_val = RIFSC->RISC_PRIVCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT];
  sec_reg_val &= (~(1U << (PeriphId & RIF_PERIPH_BIT_POSITION)));
  sec_reg_val |= (((SecPriv & RIF_ATTRIBUTE_PRIV) >> 1U) << (PeriphId & RIF_PERIPH_BIT_POSITION));
  RIFSC->RISC_PRIVCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT] = sec_reg_val;
}

/**
  * @brief  Get the Security and Privilege configuration of a designated slave peripheral.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval can be a combination of @ref RIF_SEC_PRIV
  */
uint32_t HAL_RIF_RISC_GetSlaveSecureAttributes(uint32_t PeriphId)
{
  uint32_t sec_attr;
  const __IO uint32_t *p_sec_reg;

  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_RCC_PERIPH_INDEX(PeriphId));

  p_sec_reg = &(RIFSC->RISC_SECCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  sec_attr = ((*p_sec_reg & ((uint32_t)RIF_ATTRIBUTE_SEC << (PeriphId & RIF_PERIPH_BIT_POSITION))) >> (PeriphId & RIF_PERIPH_BIT_POSITION));

  p_sec_reg = &(RIFSC->RISC_PRIVCFGRx[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  sec_attr |= (((*p_sec_reg & ((uint32_t)RIF_ATTRIBUTE_SEC << (PeriphId & RIF_PERIPH_BIT_POSITION))) >> (PeriphId & RIF_PERIPH_BIT_POSITION)) << 1U);

  return sec_attr;
}

#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Lock the Isolation and Security configuration of the designated slave peripheral.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval None
  */
void HAL_RIF_RISC_SlaveConfigLock(uint32_t PeriphId)
{
  __IO uint32_t *p_lock_reg;

  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_RCC_PERIPH_INDEX(PeriphId));

  /* Set RISC Peripheral Lock bit */
  p_lock_reg = &(RIFSC->RISC_RCFGLOCKRx[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  *p_lock_reg |= (RIF_LOCK_ENABLE << (PeriphId & RIF_PERIPH_BIT_POSITION));
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */

/**
  * @brief  Get the Isolation and Security configuration lock status.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval 1 if the Isolation and Security configuration is locked, else 0
  */
uint32_t HAL_RIF_RISC_GetSlaveConfigLock(uint32_t PeriphId)
{
  uint32_t lock_status;
  const __IO uint32_t *p_lock_reg;

  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_RCC_PERIPH_INDEX(PeriphId));

  p_lock_reg = &(RIFSC->RISC_RCFGLOCKRx[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  lock_status = ((*p_lock_reg & (RIF_LOCK_ENABLE << (PeriphId & RIF_PERIPH_BIT_POSITION))) >> (PeriphId & RIF_PERIPH_BIT_POSITION));

  return lock_status;
}

/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group4  RISAF Configuration functions
  *  @brief    RISAF Configuration functions
  *
@verbatim
  ==============================================================================
            ##### RISAF Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RISAF
    RISAL is Resource Isolation Slave unit for Address space protection (Full version)
@endverbatim
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Lock overall configuration of RISAF.
  * @note   Once set, the overall configuration of RISAF cannot be modified
  *         upon next system reset.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @retval None
  */
void HAL_RIF_RISAF_Lock(RISAF_TypeDef *RISAFx)
{
  /* Check the parameters */
  assert_param(IS_RISAF_INSTANCE(RISAFx));

  /* Set RISAF Lock bit */
  RISAFx->CR |= RISAF_CR_GLOCK;
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */

/**
  * @brief  Get RISAF global lock status.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @retval 1 if RISAF configuration is locked, else 0
  */
uint32_t HAL_RIF_RISAF_GetLock(const RISAF_TypeDef *RISAFx)
{
  uint32_t lock_status;

  /* Read RIMC lock bit */
  lock_status = (RISAFx->CR & RIF_LOCK_ENABLE);

  return lock_status;
}

#if defined(GENERATOR_RIF_FEATURE_ENCRYPTION_IMPLEMENTED)
/**
  * @brief  Get encryption and key related flags.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @retval A combination of the three encryption related flags
  */
uint32_t HAL_RIF_RISAF_GetEncryptionStatus(RISAF_TypeDef *RISAFx)
{
  uint32_t tmp = 0;

  return tmp;
}

#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Write the encryption keys used by the DDRMCE.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Keys Pointer on the Encryption keys structure
  * @retval None
  */
void HAL_RIF_RISAF_WriteEncryptionKeys(RISAF_TypeDef *RISAFx, RISAF_EncryptionKeys_t *Keys)
{
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */

