micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
#endif /* defined(GENERATOR_RIF_FEATURE_ENCRYPTION_IMPLEMENTED) */
#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Configure a RISAF Base region.
  * @note   If pConfig->Filtering is equal to RISAF_FILTER_DISABLE, this API only disable the filtering without modifying
  *         its configuration.
  * @note   It is not possible to modify the start and end address of the region if the filtering is already enabled.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  pConfig Pointer on RISAF Base Region configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_ConfigBaseRegion(RISAF_TypeDef *RISAFx, uint32_t Region, const RISAF_BaseRegionConfig_t *pConfig)
{
  /* Check the parameters */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));

  /* Only disable the section */
  if (pConfig->Filtering == RISAF_FILTER_DISABLE)
  {
    RISAFx->REG[Region].CFGR &= (~(RISAF_FILTER_ENABLE));
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_RISAF_FILTERING(pConfig->Filtering));
    assert_param(IS_RIF_CID(pConfig->PrivWhitelist));
    assert_param(IS_RIF_CID(pConfig->ReadWhitelist));
    assert_param(IS_RIF_CID(pConfig->WriteWhitelist));
    assert_param(IS_RIF_SEC_PRIV_ATTRIBUTE(pConfig->Secure));
    assert_param(IS_RISAF_GRANULARITY(RISAFx, pConfig->StartAddress));
    assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->StartAddress));
    assert_param(IS_RISAF_GRANULARITY(RISAFx, (pConfig->EndAddress + 1U)));
    assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->EndAddress));
    assert_param(pConfig->StartAddress < pConfig->EndAddress);

    /* Update region start and end addresses */
    RISAFx->REG[Region].STARTR = pConfig->StartAddress;
    RISAFx->REG[Region].ENDR = pConfig->EndAddress;

    /* Update filtering mode, security and privilege attributes and whitelists */
    RISAFx->REG[Region].CIDCFGR = (pConfig->ReadWhitelist | (pConfig->WriteWhitelist << RISAF_REGx_CIDCFGR_WRENC0_Pos));
    RISAFx->REG[Region].CFGR = (pConfig->Filtering | (pConfig->Secure << RISAF_REGx_CFGR_SEC_Pos)
                                | (pConfig->PrivWhitelist << RISAF_REGx_CFGR_PRIVC0_Pos));
  }
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */

/**
  * @brief  Get the configuration of a RISAF Base region.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  pConfig Pointer on RISAF Base Region configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_GetConfigBaseRegion(const RISAF_TypeDef *RISAFx, uint32_t Region, RISAF_BaseRegionConfig_t *pConfig)
{
  uint32_t cfgr_reg;
  uint32_t cidcfgr_reg;

  /* Check the parameters */
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));
  assert_param(pConfig != (void *)NULL);

  cfgr_reg = RISAFx->REG[Region].CFGR;
  cidcfgr_reg = RISAFx->REG[Region].CIDCFGR;

  pConfig->Filtering = (cfgr_reg & RISAF_REGx_CFGR_BREN);
  pConfig->Secure = ((cfgr_reg & RISAF_REGx_CFGR_SEC) >> RISAF_REGx_CFGR_SEC_Pos);
  pConfig->PrivWhitelist = ((cfgr_reg & (RIF_CID_MASK << RISAF_REGx_CFGR_PRIVC0_Pos)) >> RISAF_REGx_CFGR_PRIVC0_Pos);
  pConfig->ReadWhitelist = (cidcfgr_reg & RIF_CID_MASK);
  pConfig->WriteWhitelist = ((cidcfgr_reg & (RIF_CID_MASK << RISAF_REGx_CIDCFGR_WRENC0_Pos)) >> RISAF_REGx_CIDCFGR_WRENC0_Pos);
  pConfig->StartAddress = RISAFx->REG[Region].STARTR;
  pConfig->EndAddress = RISAFx->REG[Region].ENDR;
}

#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Delegate a Subregion configuration to another CID.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  SubRegion specifies the RISAB Subregion index
  *         This parameter can be one of the following values:
  *           @arg @ref RISAF_SUBREGION_A
  *           @arg @ref RISAF_SUBREGION_B
  * @param  pConfig Pointer on RISAF Subregion configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_ConfigSubRegionDelegation(RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                             const RISAF_DelegationConfig_t *pConfig)
{
  uint32_t cid;
  uint32_t nestr_reg;

  /* Check the parameters */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));
  assert_param(IS_RISAF_SUBREGION(SubRegion));
  assert_param(IS_RISAF_DELEGATION(pConfig->Delegation));
  assert_param(IS_RIF_SINGLE_CID(pConfig->DelegatedCID));

  /* Convert mask into bit position */
  cid = POSITION_VAL(pConfig->DelegatedCID);

  if (SubRegion == RISAF_SUBREGION_A)
  {
    nestr_reg = RISAFx->REG[Region].ANESTR;
    nestr_reg &= (~(RISAF_REGx_zNESTR_DCCID | RISAF_REGx_zNESTR_DCEN));
    nestr_reg |= ((cid << RISAF_REGx_zNESTR_DCCID_Pos) | pConfig->Delegation);
    RISAFx->REG[Region].ANESTR = nestr_reg;
  }
  else
  {
    nestr_reg = RISAFx->REG[Region].BNESTR;
    nestr_reg &= (~(RISAF_REGx_zNESTR_DCCID | RISAF_REGx_zNESTR_DCEN));
    nestr_reg |= ((cid << RISAF_REGx_zNESTR_DCCID_Pos) | pConfig->Delegation);
    RISAFx->REG[Region].BNESTR = nestr_reg;
  }
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */

/**
  * @brief  Get the delegation configuration of a RISAF Subregion.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  SubRegion specifies the RISAB Subregion index
  *         This parameter can be one of the following values:
  *           @arg @ref RISAF_SUBREGION_A
  *           @arg @ref RISAF_SUBREGION_B
  * @param  pConfig Pointer on RISAF Subregion configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_GetConfigSubRegionDelegation(const RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                                RISAF_DelegationConfig_t *pConfig)
{
  uint32_t cid;

  /* Check the parameters */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));
  assert_param(IS_RISAF_SUBREGION(SubRegion));

  if (SubRegion == RISAF_SUBREGION_A)
  {
    pConfig->Delegation = (RISAFx->REG[Region].ANESTR & RISAF_REGx_zNESTR_DCEN);
    cid = ((RISAFx->REG[Region].ANESTR & RISAF_REGx_zNESTR_DCCID) >> RISAF_REGx_zNESTR_DCCID_Pos);
  }
  else
  {
    pConfig->Delegation = (RISAFx->REG[Region].BNESTR & RISAF_REGx_zNESTR_DCEN);
    cid = ((RISAFx->REG[Region].BNESTR & RISAF_REGx_zNESTR_DCCID) >> RISAF_REGx_zNESTR_DCCID_Pos);
  }

  pConfig->DelegatedCID = (1UL << cid);
}

/**
  * @brief  Configure a RISAF subregion.
  * @note   If pConfig->Filtering is equal to RISAF_FILTER_DISABLE, this API only disable the filtering without modifying
  *         its configuration. It also can lock the current subregion configuration.
  * @note   It is not possible to modify the start and end address of a subregion if the filtering is already enabled.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  SubRegion specifies the RISAB Subregion index
  *         This parameter can be one of the following values:
  *           @arg @ref RISAF_SUBREGION_A
  *           @arg @ref RISAF_SUBREGION_B
  * @param  pConfig Pointer on RISAF Base Region configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_ConfigSubRegion(RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                   const RISAF_SubRegionConfig_t *pConfig)
{
  uint32_t cid;

  /* Check the parameters */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));
  assert_param(IS_RISAF_SUBREGION(SubRegion));
  assert_param(IS_RISAF_FILTERING(pConfig->Filtering));
  assert_param(IS_RIF_LOCK_STATE(pConfig->Lock));

  /* Convert mask into bit position */
  cid = POSITION_VAL(pConfig->CID);

  if (SubRegion == RISAF_SUBREGION_A)
  {
    if (pConfig->Filtering == RISAF_FILTER_DISABLE)
    {
      RISAFx->REG[Region].ACFGR &= (~(RISAF_FILTER_ENABLE | RISAF_REGx_zCFGR_RLOCK));
      RISAFx->REG[Region].ACFGR |= (pConfig->Lock << RISAF_REGx_zCFGR_RLOCK_Pos);
    }
    else
    {
      /* Check the parameters */
      assert_param(IS_RISAF_READ_WRITE(pConfig->ReadWrite));
      assert_param(IS_RIF_SEC_PRIV_ATTRIBUTE(pConfig->SecPriv));
      assert_param(IS_RISAF_GRANULARITY(RISAFx, pConfig->StartAddress));
      assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->StartAddress));
      assert_param(IS_RISAF_GRANULARITY(RISAFx, (pConfig->EndAddress + 1U)));
      assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->EndAddress));
      assert_param(pConfig->StartAddress < pConfig->EndAddress);

