micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
      RISAFx->REG[Region].ASTARTR = pConfig->StartAddress;
      RISAFx->REG[Region].AENDR = pConfig->EndAddress;
      RISAFx->REG[Region].ACFGR = (pConfig->Filtering  | (pConfig->Lock << RISAF_REGx_zCFGR_RLOCK_Pos)
                                   | (cid << RISAF_REGx_zCFGR_SRCID_Pos) | (pConfig->SecPriv << RISAF_REGx_zCFGR_SEC_Pos)
                                   | (pConfig->ReadWrite));
    }
  }
  else
  {
    if (pConfig->Filtering == RISAF_FILTER_DISABLE)
    {
      RISAFx->REG[Region].BCFGR &= (~(RISAF_FILTER_ENABLE | RISAF_REGx_zCFGR_RLOCK));
      RISAFx->REG[Region].BCFGR |= (pConfig->Lock << RISAF_REGx_zCFGR_RLOCK_Pos);
    }
    else
    {
      /* Check the parameters */
      assert_param(IS_RISAF_READ_WRITE(pConfig->ReadWrite));
      assert_param(IS_RIF_SEC_PRIV_ATTRIBUTE(pConfig->SecPriv));
      assert_param(IS_RISAF_GRANULARITY(RISAFx, pConfig->StartAddress));
      assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->StartAddress));
      assert_param(IS_RISAF_GRANULARITY(RISAFx, (pConfig->EndAddress + 1U)));
      assert_param(IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(RISAFx, pConfig->EndAddress));
      assert_param(pConfig->StartAddress < pConfig->EndAddress);

      RISAFx->REG[Region].BSTARTR = pConfig->StartAddress;
      RISAFx->REG[Region].BENDR = pConfig->EndAddress;
      RISAFx->REG[Region].BCFGR = (pConfig->Filtering  | (pConfig->Lock << RISAF_REGx_zCFGR_RLOCK_Pos)
                                   | (cid << RISAF_REGx_zCFGR_SRCID_Pos) | (pConfig->SecPriv << RISAF_REGx_zCFGR_SEC_Pos)
                                   | (pConfig->ReadWrite));
    }
  }
}

/**
  * @brief  Get the configuration of a RISAF Subregion.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  Region specifies the RISAF region index
  *         This parameter can be one one of the following values:
  *           @arg @ref RISAF_REGION_1
  *           @arg @ref RISAF_REGION_2
  *           @arg @ref RISAF_REGION_3
  *           @arg @ref RISAF_REGION_4
  *           @arg @ref RISAF_REGION_5
  *           @arg @ref RISAF_REGION_6
  *           @arg @ref RISAF_REGION_7
  *           @arg @ref RISAF_REGION_8
  *           @arg @ref RISAF_REGION_9
  *           @arg @ref RISAF_REGION_10
  *           @arg @ref RISAF_REGION_11
  *           @arg @ref RISAF_REGION_12
  *           @arg @ref RISAF_REGION_13
  *           @arg @ref RISAF_REGION_14
  *           @arg @ref RISAF_REGION_15
  * @param  SubRegion specifies the RISAB Subregion index
  *         This parameter can be one of the following values:
  *           @arg @ref RISAF_SUBREGION_A
  *           @arg @ref RISAF_SUBREGION_B
  * @param  pConfig Pointer on RISAF Base Region configuration structure
  * @retval None
  */
void HAL_RIF_RISAF_GetConfigSubRegion(const RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                      RISAF_SubRegionConfig_t *pConfig)
{
  uint32_t cid;
  uint32_t cfgr_reg;

  /* Check the parameters */
  assert_param(pConfig != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));
  assert_param(IS_RISAF_REGION(Region));
  assert_param(IS_RISAF_MAX_REGION(RISAFx, Region));
  assert_param(IS_RISAF_SUBREGION(SubRegion));

  if (SubRegion == RISAF_SUBREGION_A)
  {
    cfgr_reg = RISAFx->REG[Region].ACFGR;
    pConfig->StartAddress = RISAFx->REG[Region].ASTARTR;
    pConfig->EndAddress = RISAFx->REG[Region].AENDR;
  }
  else
  {
    cfgr_reg = RISAFx->REG[Region].BCFGR;
    pConfig->StartAddress = RISAFx->REG[Region].BSTARTR;
    pConfig->EndAddress = RISAFx->REG[Region].BENDR;
  }

  pConfig->Filtering = (cfgr_reg & RISAF_REGx_zCFGR_SREN);
  cid = ((cfgr_reg & RISAF_REGx_zCFGR_SRCID) >> RISAF_REGx_zCFGR_SRCID_Pos);
  pConfig->CID = (1UL << cid);
  pConfig->SecPriv = ((cfgr_reg & (RISAF_REGx_zCFGR_PRIV | RISAF_REGx_zCFGR_SEC)) >> RISAF_REGx_zCFGR_SEC_Pos);
  pConfig->ReadWrite = (cfgr_reg & (RISAF_REGx_zCFGR_WREN | RISAF_REGx_zCFGR_RDEN));
  pConfig->Lock = ((cfgr_reg & RISAF_REGx_zCFGR_RLOCK) >> RISAF_REGx_zCFGR_RLOCK_Pos);
}

#if defined(CPU_AS_TRUSTED_DOMAIN)
/**
  * @brief  Get the error detected by the RISAF control block,
  *         the illegal access data and clear related flags.
  *         Error information can be illegal access or control access type. In case of an illegal access detection, the
  *         error information is:
  *           - responsible CID;
  *           - security access type;
  *           - privilege access type;
  *           - read (fetch) or write access type;
  *           - targeted address.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  RISAFx specifies the RISAF instance.
  *         This parameter is one of the RISAF instances defined in the CMSIS.
  * @param  IllegalAccess Pointer on illegal access structure
  * @retval None
  */
void HAL_RIF_RISAF_GetIllegalAccess(RISAF_TypeDef *RISAFx, RISAF_IllegalAccess_t *IllegalAccess)
{
  uint32_t cid;
  uint32_t secpriv;

  /* Check the parameters */
  assert_param(IllegalAccess != (void *)NULL);
  assert_param(IS_RISAF_INSTANCE(RISAFx));

  /* Get illegal access type */
  IllegalAccess->ErrorType = (RISAFx->IASR & (RISAF_IASR_IAEF | RISAF_IASR_CAEF));

  if (IllegalAccess->ErrorType != RISAF_ILLEGAL_ACCESS_NONE)
  {
    /* Get illegal access data */
    cid = (RISAFx->IAR->IAESR & RISAF_IAESR_IACID);
    IllegalAccess->Data.CID = (1UL << cid);
    secpriv = ((RISAFx->IAR->IAESR & (RISAF_IAESR_IASEC | RISAF_IAESR_IAPRIV)) >> RISAF_IAESR_IAPRIV_Pos);
    IllegalAccess->Data.SecPriv = ((secpriv >> 1UL) | (secpriv << 1UL)) & 3UL;
    IllegalAccess->Data.AccessType = ((RISAFx->IAR->IAESR & RISAF_IAESR_IANRW) >> RISAF_IAESR_IANRW_Pos);

    if ((IllegalAccess->ErrorType & RISAF_ILLEGAL_ACCESS) != 0U)
    {
      IllegalAccess->Data.Address = RISAFx->IAR->IADDR;
    }
    else
    {
      IllegalAccess->Data.Address = 0U;
    }

    /* Clear flags */
    RISAFx->IACR = (RISAF_IACR_IAEF | RISAF_IACR_CAEF);
  }
}
#endif /* defined(CPU_AS_TRUSTED_DOMAIN) */
/**
  * @}
  */

