micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rif.c
/** @defgroup RIF_Exported_Functions_Group6  IAC Configuration functions
  * @brief    IAC Configuration functions
  *
@verbatim
  ==============================================================================
            ##### IAC Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure IAC
    IAC is Illegal Access Controller
@endverbatim
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
/**
  * @brief  Enable interrupt generation on illegal access detection on peripheral or memory access.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval None
  */
void HAL_RIF_IAC_EnableIT(uint32_t PeriphId)
{
  __IO uint32_t *p_interrupt_reg;

  /* Check parameters */
  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_AWARE_PERIPH_INDEX(PeriphId));

  p_interrupt_reg = &(IAC->IER[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  *p_interrupt_reg |= (1UL << (PeriphId & RIF_PERIPH_BIT_POSITION));

}

/**
  * @brief  Disable interrupt generation on illegal access detection on peripheral or memory access.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval None
  */
void HAL_RIF_IAC_DisableIT(uint32_t PeriphId)
{
  __IO uint32_t *p_interrupt_reg;

  /* Check parameters */
  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_AWARE_PERIPH_INDEX(PeriphId));

  p_interrupt_reg = &(IAC->IER[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  *p_interrupt_reg &= (~(1UL << (PeriphId & RIF_PERIPH_BIT_POSITION)));
}

/**
  * @brief  Get illegal access detection flag.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval Detection flag value
  */
uint32_t HAL_RIF_IAC_GetFlag(uint32_t PeriphId)
{
  uint32_t interrupt_flag;
  const __IO uint32_t *p_interrupt_reg;
  uint32_t shift_var;

  /* Check parameters */
  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_AWARE_PERIPH_INDEX(PeriphId));

  shift_var = (PeriphId & RIF_PERIPH_BIT_POSITION);
  p_interrupt_reg = &(IAC->ISR[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  interrupt_flag = ((*p_interrupt_reg & (1UL << shift_var)) >> shift_var);

  return interrupt_flag;
}

/**
  * @brief  Clear illegal access detection flag.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval None
  */
void HAL_RIF_IAC_ClearFlag(uint32_t PeriphId)
{
  __IO uint32_t *p_interrupt_reg;

  /* Check parameters */
  assert_param(IS_RIF_RISC_PERIPH_INDEX(PeriphId) || IS_RIF_AWARE_PERIPH_INDEX(PeriphId));

  p_interrupt_reg = &(IAC->ICR[PeriphId >> RIF_PERIPH_REG_SHIFT]);
  *p_interrupt_reg = (1UL << (PeriphId & RIF_PERIPH_BIT_POSITION));
}

/**
  * @brief  Parse all pending flags and call callback when necessary.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @retval None
  */
void HAL_RIF_IRQHandler(void)
{
  uint32_t reg_index;
  uint32_t flag_mask;
  uint32_t position;
  uint32_t periph_id;

  for (reg_index = 0 ; reg_index < (RIF_PERIPH_IAC_REG_MAX + 1U) ; reg_index++)
  {
    flag_mask = IAC->ISR[reg_index];

    position = 0U;
    while ((flag_mask >> position) != 0U)
    {
      if ((flag_mask & (1UL << position)) != 0U)
      {
        periph_id = ((reg_index << RIF_PERIPH_REG_SHIFT) | position);
        HAL_RIF_IAC_ClearFlag(periph_id);
        HAL_RIF_ILA_Callback(periph_id);
      }
      position++;
    }
  }
}

/**
  * @brief  RIF illegal access callback.
  * @note   This API is protected by the Trusted Domain compilation directive.
  * @note   This API is protected by the TrustZone Enabled compilation directive.
  * @param  PeriphId specifies the index of the bus slave.
  *         This parameter can be one of @ref RIF_PERIPHERAL_INDEX
  *         bits[31:28] define the register index a peripheral belongs to, value from 0 to 5
  *         bits[4:0]   define the bit position within the register, value from 0 to 31
  * @retval None
  */
__weak void HAL_RIF_ILA_Callback(uint32_t PeriphId)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(PeriphId);

  /* NOTE: This function should not be modified, when the callback is needed,
                 the HAL_RIF_ILA_Callback could be implemented in the user file
  */
}
#endif /* CPU_AS_TRUSTED_DOMAIN && CPU_IN_SECURE_STATE */
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RIF_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
